In [1]:
import pandas as pd

df = pd.read_csv("student.csv")

#head returns the top 5 rows
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [2]:
#tail returns the bottom 5 rows
df.tail()

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    NaN    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88     NaN

In [4]:
#describe prints summary statistics from all numeric columns
#include=[datatype] can be passed as an argument to only pull columns of that type
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [5]:
#info() provides a quick way to look at data ty pes, missing values etc
df.info(show_counts=True,verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    33 non-null     object
 2   class   33 non-null     object
 3   mark    35 non-null     int64
 4   gender  31 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

In [10]:
#shape can be used to show the number of rows and columns in the dataframe
df.shape #rows and columns

(35, 5)

In [11]:
df.shape[0] #rows only

35

In [12]:
df.shape[1] #columns only

5

In [15]:
#copying creates a deep copy of the dataframe
df2 = df.copy()

In [16]:
df2.isnull().head()

      id   name  class   mark  gender
0  False  False  False  False   False
1  False  False  False  False   False
2  False  False  False  False   False
3  False  False  False  False   False
4  False  False  False  False   False

In [17]:
#we can combine the isnull function with the sum function to get the counts of null values in each column
df2.isnull().sum()

id        0
name      2
class     2
mark      0
gender    4
dtype: int64

In [19]:
#isolate one column
df2['name'].head()

0      John Deo
1      Max Ruin
2        Arnold
3    Krish Star
4     John Mike
Name: name, dtype: object

In [20]:
#isolating two columns
df2[['name','gender']].head()

         name  gender
0    John Deo  female
1    Max Ruin    male
2      Arnold    male
3  Krish Star  female
4   John Mike  female

In [21]:
#get a particular row using slicing
df2[df2.index==2]

   id    name  class  mark gender
2   3  Arnold  Three    55   male

In [22]:
#using a range
df2[df2.index.isin(range(2,5))]

   id        name  class  mark  gender
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [24]:
#use iloc instead of index=, uses position
df2.iloc[20]

id                21
name      Babby John
class           Four
mark              69
gender        female
Name: 20, dtype: object

In [25]:
#loc uses row names, index values by default 
df2.loc[20]

id                21
name      Babby John
class           Four
mark              69
gender        female
Name: 20, dtype: object

In [26]:
#range of rows
df2.loc[2:10]

    id         name  class  mark  gender
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John    NaN    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female

In [27]:
#rows and specific columns
df2.loc[10:20,['name','mark']]

          name  mark
10      Ronald    89
11       Recky    94
12         Kty    88
13         NaN    88
14    Tade Row    88
15       Gimmy    88
16       Tumyu    54
17       Honny    75
18       Tinny    18
19      Jackly    65
20  Babby John    69

In [28]:
https://www.datacamp.com/tutorial/pandas

SyntaxError: invalid syntax (3957886189.py, line 1)